2019/dijkstra-algorithm.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-05 周六 16:17 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>迪杰斯特拉算法</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">迪杰斯特拉算法</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org83fafc4">1. 前言</a></li>
<li><a href="#org4bf9861">2. 算法简述</a></li>
<li><a href="#org79c5fa2">3. 算法详述</a></li>
<li><a href="#org96f9db1">4. 算法实现</a>
<ul>
<li><a href="#org6594e16">4.1. 简单的有向无权图</a></li>
<li><a href="#org809ca0c">4.2. 具体的算法实现</a></li>
<li><a href="#org68632df">4.3. 可能的实现优化</a></li>
</ul>
</li>
<li><a href="#orgeedad7f">5. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-org83fafc4" class="outline-2">
<h2 id="org83fafc4"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
Dijkstra's algorithm - 迪杰斯特拉算法应该算是相当有名的一个算法了，经常可以看到 <code>Dijkstra</code> 的大名。
</p>

<p>
本来去年最后一篇博客就打算写这个，结果期末事情有点多，忙不过来了，只能水一篇上去安慰自己 @_@
</p>

<p>
所以说，作为新的一年的第一篇博客你，冲鸭！！！
</p>
</div>
</div>

<div id="outline-container-org4bf9861" class="outline-2">
<h2 id="org4bf9861"><span class="section-number-2">2</span> 算法简述</h2>
<div class="outline-text-2" id="text-2">
<p>
迪杰斯特拉算法其实是一个很简单的算法，属于典型的贪婪算法，基本思想为：
</p>
<ul class="org-ul">
<li>保证每个阶段选取到的顶点到起始点的路径长度都是最短的</li>
</ul>

<p>
在这种情况下，迪杰斯特拉算法只需要不断计算更新选取的顶点到其 <b>邻接顶点</b> 的路径长度就可以了，这对于路径长度必然是递增的（无权或非负权）图来说，
是没有问题的，因为，对于它们来说，每一步的最优解就是整体的最优解。
</p>

<p>
然而，对于 <b>负权图</b> 来说，就不是这样的了，负权的存在，会导致一种情况的发生：
</p>
<ul class="org-ul">
<li>两点之间的最短路径不是直线，而是曲线，就像是虫洞一样</li>
</ul>

<p>
比如说，存在图 <code>G([a, b, c], [(a, b), (a, c), (b, c)])</code>, 其中，各边权重如下：
</p>
<pre class="example">
a -&gt; b = 8
a -&gt; c = 6
b -&gt; c = -3
</pre>

<p>
如果按照迪杰斯特拉算法求解，选取顶点 <code>a</code> 作为起点，得到的最短路径将会是：
</p>
<pre class="example">
a
a -&gt; b
a -&gt; c
</pre>

<p>
而实际的最短路径应该是：
</p>
<pre class="example">
a
a -&gt; b
a -&gt; b -&gt; c
</pre>

<p>
因此，在使用迪杰斯特拉算法算法时，应该保证图中不存在负权边。
</p>
</div>
</div>

<div id="outline-container-org79c5fa2" class="outline-2">
<h2 id="org79c5fa2"><span class="section-number-2">3</span> 算法详述</h2>
<div class="outline-text-2" id="text-3">
<p>
前面了解了迪杰斯特拉算法的基本思想，接下来可以了解算法的详细过程了：
</p>
<ol class="org-ol">
<li>算法开始时，将图中的所有顶点分为两组，一组为已知最短路径的顶点，一组为未知最短路径的顶点，
初始时所有顶点都属于未知最短路径的顶点，并标记每个顶点的路径长度为无穷大。</li>

<li>将起始点的路径长度设为 0</li>

<li>每个阶段中，选取所有未知最短路径的顶点中路径长度最短的那一个，将其标记为已知最短路径的顶点，</li>

<li>然后计算该顶点到其邻接顶点中属于未知最短路径的顶点的路径长度，如果计算得到的路径长度比原有的长度短，
就更新该邻接顶点的路径长度，并将该邻接顶点的前置节点设为选取的顶点</li>

<li>不断执行 3 - 4 操作，直到未知最短路径的顶点数量为 0</li>
</ol>

<p>
感觉有些绕的话，可以看看下面这段伪代码<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>：
</p>
<pre class="example">
function Dijkstra(Graph, source):

    create vertex set Q                     // 未知最短路径的顶点集合

    for each vertex v in Graph:
        dist[v] ← INFINITY                  // 起始点到该顶点的最短路径长度
        prev[v] ← UNDEFINED                 // 最短路径中该顶点的前置顶点
        add v to Q                          // 初始时，所有节点都是未知最短路径的顶点

    dist[source] ← 0                        // 将起始点的路径长度设为 0

    while Q is not empty:
        u ← vertex in Q with min dist[u]    // 选取路径长度最短的一个

        remove u from Q 

        for each adjacent v of u:           // 遍历选取的顶点的邻接顶点
            alt ← dist[u] + length(u, v)
            if alt &lt; dist[v]:               // 计算得到的路径比原有的小
                dist[v] ← alt 
                prev[v] ← u 

    return dist[], prev[]
</pre>

<p>
这个过程应该足够详细了，多余的话我也不说了 @_@
</p>
</div>
</div>

<div id="outline-container-org96f9db1" class="outline-2">
<h2 id="org96f9db1"><span class="section-number-2">4</span> 算法实现</h2>
<div class="outline-text-2" id="text-4">
<p>
事实证明，只有实际动手去敲过代码的东西印象才留的深，留的久，这里简单用 Python 实现了这一算法。
</p>
</div>

<div id="outline-container-org6594e16" class="outline-3">
<h3 id="org6594e16"><span class="section-number-3">4.1</span> 简单的有向无权图</h3>
<div class="outline-text-3" id="text-4-1">
<p>
要实现算法，首先需要有一个图结构，这里简单实现了一个有向无权图，无项图和有权图都有点麻烦 @_@
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Graph</span>(<span style="font-weight: bold;">object</span>):
    <span style="font-style: italic;">"""Simple directed non-right graph implementation."""</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, vertices=<span style="font-weight: bold; text-decoration: underline;">None</span>, edges=<span style="font-weight: bold; text-decoration: underline;">None</span>):
        <span style="font-weight: bold;">if</span> vertices:
            <span style="font-weight: bold;">self</span>.vertices = {ver: <span style="font-weight: bold;">set</span>() <span style="font-weight: bold;">for</span> ver <span style="font-weight: bold;">in</span> vertices}
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">self</span>.vertices = []
        <span style="font-weight: bold;">if</span> edges:
            <span style="font-weight: bold;">self</span>.add_edges(edges)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">add_edges</span>(<span style="font-weight: bold;">self</span>, edges):
        <span style="font-weight: bold;">for</span> u, v <span style="font-weight: bold;">in</span> edges:
            <span style="font-weight: bold;">self</span>.vertices.setdefault(u, <span style="font-weight: bold;">set</span>())
            <span style="font-weight: bold;">self</span>.vertices.setdefault(v, <span style="font-weight: bold;">set</span>())
            <span style="font-weight: bold;">self</span>.vertices[u].add(v)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">add_edge</span>(<span style="font-weight: bold;">self</span>, edge):
        <span style="font-weight: bold;">self</span>.add_edges([edge])

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__repr__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">repr</span>(<span style="font-weight: bold;">self</span>.vertices)
</pre>
</div>

<p>
借助 Python 内置的字典和集合可以很简单的实现这一结构，不得不说，很方便。
</p>
</div>
</div>

<div id="outline-container-org809ca0c" class="outline-3">
<h3 id="org809ca0c"><span class="section-number-3">4.2</span> 具体的算法实现</h3>
<div class="outline-text-3" id="text-4-2">
<p>
利用 Python 来实现这一算法的思考过程：
</p>
<ul class="org-ul">
<li>首先，是已知和未知集合的确定，因为只有两种情况，因此只需要创建其中一个集合就足够了。
同时，Python 内置的集合结构可以直接拿来用，简单。</li>

<li>然后，是每个顶点距离和前置顶点的保存，Python 中可以考虑用字典来实现，建立顶点到距离和顶点到前置顶点的映射。
这一步也很简单。</li>

<li>其次，是选取路径长度最短的未知顶点，常规的实现就是遍历所有未知节点，找出最短的那一个。这一步较为耗时，</li>

<li>最后，是遍历更新邻接顶点的长度，需要注意过滤邻接顶点中的已知顶点。</li>
</ul>

<p>
可以看到，算法的实现不是太难，当然，Python 的简便也提供了很大的帮助：
</p>

<details><summary><i>点击查看代码</i></summary>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Graph</span>(<span style="font-weight: bold;">object</span>):
    <span style="font-style: italic;">"""Simple directed non-right graph implementation."""</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_min</span>(<span style="font-weight: bold;">self</span>, dv, known_vertices):
        <span style="font-weight: bold; font-style: italic;">rver</span>, <span style="font-weight: bold; font-style: italic;">rdis</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>, <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">'inf'</span>)
        <span style="font-weight: bold;">for</span> ver, dis <span style="font-weight: bold;">in</span> dv.items():
            <span style="font-weight: bold;">if</span> dis &lt; rdis <span style="font-weight: bold;">and</span> ver <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">in</span> known_vertices:
                <span style="font-weight: bold; font-style: italic;">rver</span>, <span style="font-weight: bold; font-style: italic;">rdis</span> = ver, dis
        <span style="font-weight: bold;">return</span> rver

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dijkstra</span>(<span style="font-weight: bold;">self</span>, start):
        <span style="font-weight: bold; font-style: italic;">known_vertices</span> = <span style="font-weight: bold;">set</span>()

        <span style="font-weight: bold; font-style: italic;">dv</span> = {ver: <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">'inf'</span>) <span style="font-weight: bold;">for</span> ver <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.vertices}
        <span style="font-weight: bold; font-style: italic;">pv</span> = {ver: <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">for</span> ver <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.vertices}

        <span style="font-weight: bold; font-style: italic;">dv</span>[start] = 0
        <span style="font-weight: bold;">while</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">len</span>(known_vertices) == <span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.vertices):
            <span style="font-weight: bold; font-style: italic;">ver</span> = <span style="font-weight: bold;">self</span>.get_min(dv, known_vertices)
            known_vertices.add(ver)
            <span style="font-weight: bold;">for</span> adjacent <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.vertices[ver] - known_vertices:
                <span style="font-weight: bold;">if</span> dv[ver] + 1 &lt; dv[adjacent]:
                    <span style="font-weight: bold; font-style: italic;">dv</span>[adjacent] = dv[ver] + 1
                    <span style="font-weight: bold; font-style: italic;">pv</span>[adjacent] = ver

        <span style="font-weight: bold; font-style: italic;">result</span> = []
        <span style="font-weight: bold;">for</span> ver <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.vertices:
            <span style="font-weight: bold; font-style: italic;">path</span> = [ver]
            <span style="font-weight: bold;">while</span> pv[ver]:
                <span style="font-weight: bold; font-style: italic;">ver</span> = pv[ver]
                path.insert(0, ver)
            result.append(path)
        <span style="font-weight: bold;">return</span> result

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__repr__</span>(<span style="font-weight: bold;">self</span>):
</pre>
</div>

</details>

<p>
代码写的有点丑，凑合着看吧 @_@
</p>

<p>
执行测试：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">g</span> = Graph([1, 2, 3, 4, 5, 6, 7])
&gt;&gt;&gt; g.add_edges([(1, 2), (1, 4)])
&gt;&gt;&gt; g.add_edges([(2, 4), (2, 5)])
&gt;&gt;&gt; g.add_edges([(3, 1), (3, 6)])
&gt;&gt;&gt; g.add_edges([(4, 3), (4, 5), (4, 6), (4, 7)])
&gt;&gt;&gt; g.add_edges([(5, 7)])
&gt;&gt;&gt; g.add_edges([(7, 6)])
&gt;&gt;&gt; g.dijkstra(1)
[[1], [1, 2], [1, 4, 3], [1, 4], [1, 2, 5], [1, 4, 6], [1, 4, 7]]
</pre>
</div>
</div>
</div>

<div id="outline-container-org68632df" class="outline-3">
<h3 id="org68632df"><span class="section-number-3">4.3</span> 可能的实现优化</h3>
<div class="outline-text-3" id="text-4-3">
<p>
算法的实现还是很简单的，但是很明显的，还存在优化空间，就是那个比较耗时的一步：选取最短未知顶点。
</p>

<p>
当然了，前面我写的那个代码可以优化的地方更多 QAQ
</p>

<p>
选取最短未知顶点可以概括为：不断选取某集合中的最小成员。这一点和一个数据结构的操作很像，
那就是 <span class="underline">优先队列 - 堆</span> ！
</p>

<p>
堆的常用操作就是找出、返回、删除集合中最小的元素，这一点和选取最短未知顶点的操作不谋而合。
</p>

<p>
因此，我们可以考虑用堆来替换选取最短未知顶点的遍历操作，而这一点，也已经有很多前辈考虑到了。
</p>

<p>
在很多资料上，我也看到了利用斐波那契堆<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>来提高迪杰斯特拉算法的效率的说法。
</p>

<p>
我也去简单的了解了一下斐波那契堆的实现，发现还是有点复杂的，所以这里就不多说了，只简单提一下这种可能。
</p>

<p>
如果你有兴趣，也有能力，可以去尝试实现，当然了，Python 中其实内置了有堆结构，也可以直接拿来用 @_@
</p>
</div>
</div>
</div>

<div id="outline-container-orgeedad7f" class="outline-2">
<h2 id="orgeedad7f"><span class="section-number-2">5</span> 结语</h2>
<div class="outline-text-2" id="text-5">
<p>
全程无图的博客，还是和图结构相关的博客，阅读体验估计不太好 &gt;_&gt;
</p>

<details><summary><i>隐藏内容</i></summary>

<p>
然而画图好麻烦&#x2026;&#x2026;
</p>

</details>

<p>
不得不说，这个算法比我想象的简单很多，这也不是第一个认为很难其实不难的东西了。
</p>

<p>
果然，有些东西还是要去尝试一下才知道是怎么一回事！
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
来自 <a href="https://en.wikipedia.org/wiki/Dijkstra's_algorithm#Pseudocode">Dijkstra's algorithm - Wikipedia</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
参考 <a href="https://zh.wikipedia.org/wiki/%E6%96%90%E6%B3%A2%E9%82%A3%E5%A5%91%E5%A0%86">斐波那契堆 - 维基百科，自由的百科全书</a>     
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
